tap "adoptopenjdk/openjdk"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jeffreywildman/virt-manager"
tap "jzelinskie/duckdns"
brew "ansible"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "colordiff"
brew "ctop"
brew "diff-so-fancy"
brew "docker-completion"
brew "docker-compose-completion"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "glances"
brew "go"
brew "gradle"
brew "handbrake", link: false
brew "helm"
brew "htop"
brew "httpie"
brew "hub"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "lastpass-cli"
brew "lazydocker"
brew "libxml2"
brew "mas"
brew "maven"
brew "maven-completion"
brew "ncdu"
brew "node"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-which-ext"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "tree"
brew "watch"
brew "wget"
brew "xml-coreutils"
brew "xmlstarlet"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "github/gh/gh"
cask "adobe-digital-editions"
cask "adobe-dng-converter"
cask "android-file-transfer"
cask "appcleaner"
cask "calibre"
cask "db-browser-for-sqlite"
cask "docker"
cask "geotag"
cask "gfxcardstatus"
cask "google-chrome"
cask "handbrake"
cask "intellij-idea-ce"
cask "iterm2"
cask "adoptopenjdk8"
cask "java"
cask "keepingyouawake"
cask "lastpass"
cask "libreoffice"
cask "musicbrainz-picard"
cask "qlgradle"
cask "slack"
cask "subler"
cask "tor-browser"
cask "touchswitcher"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "xnviewmp"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft OneNote", id: 784801555
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
